cask_args appdir: '/Applications'

# taps
tap 'caskroom/homebrew-cask' || true
tap 'homebrew/core' || true
tap 'homebrew/cask-drivers' || true

# version control
brew 'git'

# languages
brew 'go'
brew 'python'
brew 'rust'

# utilities
brew 'wget'
brew 'watch'
brew 'jq'
brew 'yq'
brew 'tmux'
brew 'openssl'
brew 'kubernetes-cli'
brew 'zsh'
brew 'bash'
brew 'rg'
brew 'fzf'
brew 'autoconf'
brew 'automake'
brew 'nmap'
brew 'diff-so-fancy'
brew 'awk'
brew 'nvim'
brew 'zsh-history-substring-search'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'docker'
cask 'aerial'
cask '1password'
cask 'alacritty'
